l =     ['값', '같', '곬', '곶', '깎', '넋', '늪', '닫', '닭', '닻', '됩', '뗌', '략', '몃', '밟', '볘', '뺐', '뽈', '솩', '쐐', '앉', '않', '얘', '얾', '엌', '옳', '읊', '쮜', '죡', '춰', '츄', '퀭', '핀', '틔', '핥', '훟']
l2 =    ['값', '같', '곬', '곶', '깎', '넋', '늪', '닫', '닭', '닻', '됩', '뗌', '략', '몃', '밟', '볘', '뺐', '뽈', '솩', '쐐', '앉', '않', '얘', '얾', '엌', '옳', '읊', '쮜', '죡', '춰', '츄', '퀭', '핀', '틔', '핥', '훟']
s =     {'엌', '뗌', '됩', '읊', '곶', '뽈', '퀭', '곬', '깎', '닻', '같', '핥', '밟', '핀', '춰', '얘', '쮜', '넋', '늪', '값', '훟', '쐐', '닫', '략', '솩', '옳', '닭', '틔', '얾', '않', '볘', '츄', '앉', '뺏', '몃', '죡'}
s2 =    {'엌', '뗌', '됩', '읊', '곶', '뽈', '퀭', '곬', '깎', '닻', '같', '핥', '밟', '핀', '춰', '얘', '쮜', '넋', '늪', '값', '훟', '쐐', '닫', '략', '솩', '옳', '닭', '틔', '얾', '않', '볘', '츄', '앉', '뺏', '몃', '죡'}
print(set(l))
print(set(l).intersection(s))
print(set(l2))
print(set(l2).intersection(s2))

print()
print(set(l2).difference(s2))